index_tasks = {
    "tasks": [
        {"task": "Задание 6",
         "description": """<p>Создать страницу, на которой будет форма для ввода имени 
         и возраста пользователя и кнопка 'Отправить'.</p>
        <p>При нажатии на кнопку будет произведена проверка возраста и переход на страницу с результатом 
        или на страницу с ошибкой в случае некорректного возраста.</p>""",
         "link": "/age_check/"},
        {"task": "Задание 7",
         "description": """<p>Создать страницу, на которой будет форма для ввода числа и кнопка 'Отправить'.</p>
<p>При нажатии на кнопку будет произведено перенаправление на страницу с результатом, 
где будет выведено введенное число и его квадрат.</p>""",
         "link": "/num_to_sqrt/"},
        {"task": "Задание 8",
         "description": """<p>Создать страницу, на которой будет форма для ввода имени и кнопка 'Отправить'.</p>
<p>При нажатии на кнопку будет произведено перенаправление на страницу с flash сообщением, 
где будет выведено 'Привет, {имя}!'.</p>""",
         "link": "/flash_task/"},
        {"task": "Задание 9",
         "description": """<p>Создать страницу, на которой будет форма для ввода имени и электронной почты.</p>
<p>При отправке которой будет создан cookie файл с данными пользователя.</p>
<p>Также будет произведено перенаправление на страницу приветствия, где будет отображаться имя пользователя.</p>
<p>На странице приветствия должна быть кнопка 'Выйти'.</p>
<p>При нажатии на кнопку будет удален cookie файл с данными пользователя и 
произведено перенаправление на страницу ввода имени и электронной почты.</p>""",
         "link": "/cookie_task/"},
    ],
}